app/controllers/sessions_controller.rb

SELECT  "developers".* FROM "developers" WHERE "developers"."email" = ? LIMIT 1  [["email", "sean@123"]]
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "tianqing705@123.com"]]
---
  def create
    user=Developer.find_by(email: params[:session][:email].downcase) if params[:loginas]== '1'
    user=Admin.find_by(email: params[:session][:email].downcase) if params[:loginas]== '2'